Tekla.Structures.Model.Collaboration.ReferenceModelObjectAttribute.AttributeTypeEnum
All the reference model object attribute types.

Tekla.Structures.Model.Collaboration.ReferenceModelObjectAttribute.AttributeTypeEnum.ATTRIBUTETYPE_INVALID
The invalid attribute type.

Tekla.Structures.Model.Collaboration.ReferenceModelObjectAttribute.AttributeTypeEnum.ATTRIBUTETYPE_IFC2X3_PARAMETRICOBJECT_CSHAPEPROFILE
The C-shape profile attribute type.

Tekla.Structures.Model.Collaboration.ReferenceModelObjectAttribute.AttributeTypeEnum.ATTRIBUTETYPE_IFC2X3_PARAMETRICOBJECT_CIRCLEHOLLOWPROFILE
The circular and hollow profile attribute type.

Tekla.Structures.Model.Collaboration.ReferenceModelObjectAttribute.AttributeTypeEnum.ATTRIBUTETYPE_IFC2X3_PARAMETRICOBJECT_CIRCLEPROFILE
The circular profile attribute type.

Tekla.Structures.Model.Collaboration.ReferenceModelObjectAttribute.AttributeTypeEnum.ATTRIBUTETYPE_IFC2X3_PARAMETRICOBJECT_ELLIPSEPROFILE
The ellipse profile attribute type.

Tekla.Structures.Model.Collaboration.ReferenceModelObjectAttribute.AttributeTypeEnum.ATTRIBUTETYPE_IFC2X3_PARAMETRICOBJECT_ISHAPEPROFILE
The I-shape profile attribute type.

Tekla.Structures.Model.Collaboration.ReferenceModelObjectAttribute.AttributeTypeEnum.ATTRIBUTETYPE_IFC2X3_PARAMETRICOBJECT_LSHAPEPROFILE
The L-shape profile attribute type.

Tekla.Structures.Model.Collaboration.ReferenceModelObjectAttribute.AttributeTypeEnum.ATTRIBUTETYPE_IFC2X3_PARAMETRICOBJECT_RECTANGLEHOLLOWPROFILE
The rectangular and hollow profile attribute type.

Tekla.Structures.Model.Collaboration.ReferenceModelObjectAttribute.AttributeTypeEnum.ATTRIBUTETYPE_IFC2X3_PARAMETRICOBJECT_RECTANGLEPROFILE
The rectangular profile attribute type.

Tekla.Structures.Model.Collaboration.ReferenceModelObjectAttribute.AttributeTypeEnum.ATTRIBUTETYPE_IFC2X3_PARAMETRICOBJECT_TSHAPEPROFILE
The T-shape profile attribute type.

Tekla.Structures.Model.Collaboration.ReferenceModelObjectAttribute.AttributeTypeEnum.ATTRIBUTETYPE_IFC2X3_PARAMETRICOBJECT_USHAPEPROFILE
The U-shape profile attribute type.

Tekla.Structures.Model.Collaboration.ReferenceModelObjectAttribute.AttributeTypeEnum.ATTRIBUTETYPE_IFC2X3_PARAMETRICOBJECT_ZSHAPEPROFILE
The Z-shape profile attribute type.

Tekla.Structures.Model.Collaboration.ReferenceModelObjectAttribute.AttributeTypeEnum.ATTRIBUTETYPE_PARAMETRICOBJECT_CUSTOMPROFILE
The custom profile attribute type.

Tekla.Structures.Model.Collaboration.ReferenceModelObjectAttribute.AttributeTypeEnum.ATTRIBUTETYPE_PARAMETRICOBJECT_OBB
The object bounding box (OBB) attribute type.